app/views/comments/index.html.erb

  <tr>
  <% product.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" IN (1, 3, 5, 6, 7, 9)