app/controllers/comments_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
---
	def new
		@product = Product.find(params[:product_id])

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "comments" ("author", "content", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["author", "fejio"], ["content", "fewaf"], ["created_at", Mon, 16 Sep 2013 22:46:16 UTC +00:00], ["product_id", 1], ["updated_at", Mon, 16 Sep 2013 22:46:16 UTC +00:00]]
---
	def create
    	@product = Product.find(params[:product_id])
    	@comment = @product.comments.create(params[:comment])

SELECT "comments".* FROM "comments" WHERE "comments"."product_id" IN (1, 3, 5, 6, 7, 9)
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"
---
  	def index
	    @products = Product.includes(:comments)#loads all comments on one query. Eager loading
	    @categorys = Category.all