app/controllers/products_controller.rb

  def index
    @products = Product.includes(:comments)#loads all comments on one query. Eager loading
    @categorys = Category.all
---
SELECT "comments".* FROM "comments" WHERE "comments"."product_id" IN (1, 3, 5, 6, 7)
SELECT "products".* FROM "products"
SELECT "categories".* FROM "categories"

  def create
    @product = Product.new(params[:product])

      if @product.save
---
INSERT INTO "products" ("category_id", "created_at", "description", "name", "pricing", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["category_id", 1], ["created_at", Mon, 16 Sep 2013 04:04:24 UTC +00:00], ["description", "fewa"], ["name", "few"], ["pricing", 555.0], ["updated_at", Mon, 16 Sep 2013 04:04:24 UTC +00:00]]

  def update
    @product = Product.find(params[:id])

    if @product.update_attributes(params[:product])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "products" SET "name" = 'Somethign', "description" = 'somethign', "pricing" = 4.56, "updated_at" = '2013-09-16 03:16:37.036635' WHERE "products"."id" = 3