app/views/products/edit.html.erb

SELECT "categories".* FROM "categories"
---
    <%= f.label :category_id %>
    <%= f.collection_select :category_id, Category.all, :id, :name %>