app/views/products/index.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."product_id" IN (1, 3, 5, 6, 7)
---
    <td><%= product.category_id %></td><!--convert into category name later -->
<% product.comments.limit(2).each do |comment| %>